{
    "timeline":
    {
        "headline":"Expériences professionnelles",
        "type":"default",
        "text":"<p>Venez découvrir mes expériences au travers de cette timeline</p>",
        "date": [
            {
                "startDate":"2011,04,22",
                "endDate":"2011,06,29",
                "headline":"Développeur Web - Cité Scolaire Stendhal",
                "text":"<p>Une double mission s'offrait à moi. Je devais dans un premier temps résoudre quelques bugs présents sur un agenda collaboratif utilisé par le personnel de la cité scolaire. Loutil était développé en PHP 4 et JavaScript sur une base de données MySQL. En s'appuyant sur ces technologies, j'avais pour mission ensuite la réalisation d'un outil de réservation de salles simple et performant exclusivement à destination des enseignants.</p>",
                "classname":"dut-exp",
                "asset": {
                    "media":"../img/cite-scolaire-stendhal.png",
                    "thumbnail":"../img/cite-scolaire-stendhal-32x32.png"
                }
            },
            {
                "startDate":"2012,05,07",
                "endDate":"2012,07,09",
                "headline":"Développeur Web - Université Joseph Fourier",
                "text":"<p>A peine plus de deux mois afin de livrer un prototype d'application permettant aux enseignants-chercheurs de pouvoir réserver leurs futurs enseignements. Coté persistance des données, j'ai eu la chance de pouvoir utiliser le framework Hibernate permettant le mapping relationnel-objet. Côté technologie, Java avec J2EE nous a paru le choix le plus sage compte tenu de notre connaissance avancée de Java.</p>",
                "classname":"licence-exp",
                "asset": {
                    "media":"../img/ujf-logo.jpg",
                    "thumbnail":"../img/ujf-logo-32x32.jpg"
                }
            },
            {
                "startDate":"2013,05,20",
                "endDate":"2013,08,09",
                "headline":"Développeur Web - Shopping Adventure",
                "text":"<p>Positionnée sur le secteur du Web To Store, Shopping Adventure est une start-up qui a été créée en 2009. C'est ausein de la cellule de développement grenobloise, sous la tutelle de Rémi Alvado que j'ai eu la chance d'intégrer cette entreprise pour ce stage de Master 1. J'ai notamment pu travailler avec les dernières technologies du Web actuel à savoir: Symfony 2.3, HTML5, CSS3 et surtout JavaScript (KnockoutJS et RequireJS). Accompagné d'un autre stagiaire, notre mission consistait en la réalisation d'applications web afin de permettre aux administrateurs de gérer le contenu plus facilement. Ces applications devaient être réalisées entièrement en JavaScript. C'est donc en utilisant des Web services que ces applications pouvaient intéragir avec une base de données.</p>",
                "classname":"m1-exp",
                "asset": {
                    "media":"../img/logo-shopping-adventure.jpg",
                    "thumbnail":"../img/logo-shopping-adventure-32x32.jpg"
                }
            },
            {
                "startDate":"2013,09,16",
                "endDate":"2014,09,15",
                "headline":"Développeur Web - Shopping Adventure",
                "text":"<p>Dans la continuité du stage de Master 1, j'ai eu pour mission d'intervenir à plusieurs niveaux dans l'architecture globale de l'entreprise. La première partie de l'année fût entièrement consacrée à la compréhension de la chaine transformation. Au programme: un chantier important au niveau d'interfaces destinées au gestionnaire de contenu afin de lui permettre d'enrichir les données facilement. Ces interfaces, ont entièrement été réalisées en Javascript grâce au framework KnockoutJS. J'ai également eu l'occasion de développer certains web services sur lesquels venaient se brancher les interfaces. Certains de ces web services ont été écrit en Python en utilisant le micro-framework Flask. Un autre travail sur cette première partie de l'année concernait l'intégration de nouveaux partenaires. Cela se faisait notament grâce à des feuilles de transformation XSLT</p>",
                "classname":"alternance-exp",
                "asset": {
                    "media":"../img/logo-shopping-adventure.jpg",
                    "thumbnail":"../img/logo-shopping-adventure-32x32.jpg"
                }
            }
        ],
        "era": [
            {
                "startDate":"2011,04,22",
                "endDate":"2011,06,29",
                "headline":"Stage DUT Informatique"
            },
            {
                "startDate":"2012,05,07",
                "endDate":"2012,07,09",
                "headline":"Stage Licence 3 MIAGE"
            },
            {
                "startDate":"2013,05,20",
                "endDate":"2013,08,09",
                "headline":"Stage Master 1 MIAGE"
            },
            {
                "startDate":"2013,09,16",
                "endDate":"2014,09,15",
                "headline":"Alternance Master 2 MIAGE"
            }

        ]

    }
}